# PANDAS LIBRARY

In [62]:
import pandas as pd
import numpy as np

## Convert list to series data type object

In [63]:
data = pd.Series([2, 4, 6, 8, 10])
print(data)

0     2
1     4
2     6
3     8
4    10
dtype: int64

## Convert series to python list type object

In [64]:
data = pd.Series([2, 4, 6, 8, 10])
print("Pandas Series and type")
print(data)
print(type(data))
print("Convert Pandas Series to Python list")
print(data.tolist())
print(type(data.tolist()))

Pandas Series and type
0     2
1     4
2     6
3     8
4    10
dtype: int64
<class 'pandas.core.series.Series'>
Convert Pandas Series to Python list
[2, 4, 6, 8, 10]
<class 'list'>

## Arithmetic operations on two panda series

In [65]:
dataset1 = pd.Series([2, 4, 6, 8, 10])
dataset2 = pd.Series([1, 3, 5, 7, 9])
dataset = dataset1 + dataset2
print("Add two Series:")
print(dataset)
print("Subtract two Series:")
dataset = dataset1 - dataset2
print(dataset)
print("Multiply two Series:")
datatset = dataset1 * dataset2
print(datatset)
print("Divide Series1 by Series2:")
dataset = dataset1 / dataset2
print(dataset)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

## Element wise raise to the power in series

In [66]:
dataset = pd.Series([0, 1, 2, 3, 4, 5, 6])
print(dataset)
print("Raised to the power 3")
dataset = dataset ** 3
print(dataset)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64
Raised to the power 3
0      0
1      1
2      8
3     27
4     64
5    125
6    216
dtype: int64

## Convert dictionary to dataframe

In [67]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
              'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
              'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
              'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## info of above dataset

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

## get first three row of above dataframe

In [69]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

## Select name and score column

In [70]:
df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

## Select rows 1,3,5,6 and column 1,3

In [71]:
df.iloc[[1,3,5,6],[1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

## Select rows where no of attempts > 2

In [72]:
print(df[df.attempts > 2])
print("Another way")
df[df["attempts"]>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes
Another way

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

## Find the no of rows and column

In [73]:
print(df.shape)

(10, 4)

## Select the rows where score is none

In [74]:
print(df[df["score"].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

## Row where no_of_attempts <2 and score greater than 15

In [75]:
df[(df["attempts"] < 2) & (df["score"]> 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

## Set score in row d to 11.5

In [76]:
df.loc["d","score"] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Calculate sum of attempts

In [77]:
df.attempts.sum()

19

## Calculate mean of scores

In [78]:
df.score.mean()

13.333333333333334

## Adding a new row to the dataframe

In [79]:
df.loc["k"]=["Suresh",15.5,1,"yes"]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

## Dropping the k th row

In [80]:
df.drop("k")

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Sorting by columns

In [81]:
df.sort_values(by='name', ascending= False)

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [82]:
df.sort_values(by = "score",ascending= True).dropna()

        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
k     Suresh   15.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes

## Replacing values of qualify column to pass or fail

In [83]:
df["qualify"] = df["qualify"].map({"yes":"Pass","no":"Fail"})

df

## deleting column from dataframs

In [84]:
df.pop("attempts")

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
k    1
Name: attempts, dtype: int64

## Adding new colour column to the dataframe

In [85]:
df["colour"]=['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red',"Blue"]

In [86]:
df

        name  score qualify  colour
a  Anastasia   12.5    Pass     Red
b       Dima    9.0    Fail    Blue
c  Katherine   16.5    Pass  Orange
d      James   11.5    Fail     Red
e      Emily    9.0    Fail   White
f    Michael   20.0    Pass   White
g    Matthew   14.5    Pass    Blue
h      Laura    NaN    Fail   Green
i      Kevin    8.0    Fail   Green
j      Jonas   19.0    Pass     Red
k     Suresh   15.5    Pass    Blue

## iterate over rows

In [87]:
for index, row in df.iterrows():
    print(row["name"],row["score"])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James 11.5
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0
Suresh 15.5

## Get list from dataframe column headers

In [88]:
print(list(df.columns.values))

['name', 'score', 'qualify', 'colour']